vertical-pod-autoscaler/experiments/sn-pbr-throughput/9plus/compose.log
Running 15m test @ http://10.101.95.109:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 16.659ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 18.978ms, rate sampling interval: 57ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   394.61ms  402.55ms   1.83s    86.41%
    Req/Sec     4.87      9.51    40.00     76.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  272.13ms
 75.000%  545.28ms
 90.000%  917.50ms
 99.000%    1.83s 
 99.900%    2.85s 
 99.990%    3.79s 
 99.999%    4.01s 
100.000%    4.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.543     0.000000            1         1.00
      35.743     0.100000          885         1.11
      80.639     0.200000         1769         1.25
     135.807     0.300000         2653         1.43
     199.423     0.400000         3537         1.67
     272.127     0.500000         4422         2.00
     312.319     0.550000         4862         2.22
     358.399     0.600000         5303         2.50
     414.719     0.650000         5745         2.86
     477.439     0.700000         6188         3.33
     545.279     0.750000         6629         4.00
     592.895     0.775000         6853         4.44
     637.439     0.800000         7072         5.00
     701.951     0.825000         7292         5.71
     758.783     0.850000         7513         6.67
     826.879     0.875000         7734         8.00
     871.423     0.887500         7845         8.89
     918.015     0.900000         7956        10.00
     959.487     0.912500         8066        11.43
    1014.783     0.925000         8177        13.33
    1094.655     0.937500         8287        16.00
    1140.735     0.943750         8342        17.78
    1197.055     0.950000         8397        20.00
    1242.111     0.956250         8452        22.86
    1305.599     0.962500         8507        26.67
    1374.207     0.968750         8562        32.00
    1413.119     0.971875         8590        35.56
    1449.983     0.975000         8618        40.00
    1509.375     0.978125         8646        45.71
    1565.695     0.981250         8673        53.33
    1636.351     0.984375         8700        64.00
    1686.527     0.985938         8714        71.11
    1736.703     0.987500         8728        80.00
    1795.071     0.989062         8742        91.43
    1866.751     0.990625         8756       106.67
    1955.839     0.992188         8769       128.00
    2011.135     0.992969         8776       142.22
    2069.503     0.993750         8783       160.00
    2160.639     0.994531         8790       182.86
    2240.511     0.995313         8798       213.33
    2310.143     0.996094         8804       256.00
    2338.815     0.996484         8807       284.44
    2381.823     0.996875         8811       320.00
    2437.119     0.997266         8814       365.71
    2484.223     0.997656         8818       426.67
    2643.967     0.998047         8821       512.00
    2693.119     0.998242         8823       568.89
    2768.895     0.998437         8825       640.00
    2799.615     0.998633         8827       731.43
    2846.719     0.998828         8828       853.33
    2887.679     0.999023         8830      1024.00
    2975.743     0.999121         8831      1137.78
    3031.039     0.999219         8832      1280.00
    3031.039     0.999316         8832      1462.86
    3041.279     0.999414         8833      1706.67
    3133.439     0.999512         8834      2048.00
    3143.679     0.999561         8835      2275.56
    3143.679     0.999609         8835      2560.00
    3143.679     0.999658         8835      2925.71
    3385.343     0.999707         8836      3413.33
    3385.343     0.999756         8836      4096.00
    3788.799     0.999780         8837      4551.11
    3788.799     0.999805         8837      5120.00
    3788.799     0.999829         8837      5851.43
    3788.799     0.999854         8837      6826.67
    3788.799     0.999878         8837      8192.00
    4005.887     0.999890         8838      9102.22
    4005.887     1.000000         8838          inf
#[Mean    =      394.613, StdDeviation   =      402.550]
#[Max     =     4003.840, Total count    =         8838]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8955 requests in 15.00m, 1.84MB read
  Socket errors: connect 0, read 0, write 4, timeout 19
Requests/sec:      9.95
Transfer/sec:      2.09KB